randread/32_node/job_1470974_fiojob_32/nid00133_fiojob_32/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 32 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=32): err= 0: pid=142210: Mon Jul 19 19:24:51 2021
  read: IOPS=1868, BW=7475KiB/s (7655kB/s)(2190MiB/300053msec)
    slat (usec): min=486, max=282933, avg=17094.70, stdev=13802.15
    clat (usec): min=13, max=7693.8k, avg=4328153.09, stdev=772947.86
     lat (msec): min=4, max=7736, avg=4345.25, stdev=775.41
    clat percentiles (msec):
     |  1.00th=[ 2106],  5.00th=[ 3540], 10.00th=[ 3641], 20.00th=[ 3775],
     | 30.00th=[ 3876], 40.00th=[ 4010], 50.00th=[ 4178], 60.00th=[ 4396],
     | 70.00th=[ 4597], 80.00th=[ 4866], 90.00th=[ 5336], 95.00th=[ 5805],
     | 99.00th=[ 6342], 99.50th=[ 6544], 99.90th=[ 7013], 99.95th=[ 7148],
     | 99.99th=[ 7617]
   bw (  KiB/s): min= 2496, max=13210, per=100.00%, avg=7487.03, stdev=46.53, samples=18858
   iops        : min=  624, max= 3302, avg=1871.76, stdev=11.63, samples=18858
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.03%, 250=0.10%
  lat (msec)   : 500=0.17%, 750=0.13%, 1000=0.11%, 2000=0.39%, >=2000=99.04%
  cpu          : usr=0.17%, sys=1.04%, ctx=561078, majf=0, minf=9450
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=560756,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=7475KiB/s (7655kB/s), 7475KiB/s-7475KiB/s (7655kB/s-7655kB/s), io=2190MiB (2297MB), run=300053-300053msec